# 生物信息学实践
## 第一次课堂笔记简要
### 一 总体介绍
1.课程介绍
2.前置基础
3.教学材料及方法
### 二 生物信息学基础
1.研究的问题
2.生物信息数据
3.数据分析
4.模型与算法
### 三 研究范式

#### 模型：机器学习模型，小到线性回归，大到深度学习
线性回归、逻辑回归、决策树、感知机、神经网络、支持向量机、随机森林、聚类算法、贝叶斯网络、深度学习等
#### 算法：编程的逻辑、迭代，解决软件工程中的一些排序、搜索、求解等问题
参数优化、调整、运算逻辑
#### 查询引用定义
> 算法是一系列明确的步骤和规则，解决给定问题的方法和过程。  它是一种可执行的操作序列，用于处理输入数据并得到期望的输出结果。  算法可以是基于数学、统计学、逻辑等不同的原理，用来解决各种问题。
> 
> 模型是对真实世界问题的抽象和表示。  它描述了观察数据和预测目标之间的关系，并通过学习和训练来构建一个函数或关系。  模型可以是数学模型、统计模型、概率模型等等，用来描述和预测数据。
> 
> 在机器学习中，算法被用于训练和构建模型。算法根据输入的数据和目标输出，学习和调整模型的参数和权重，使其在未见过的数据上产生准确的预测。模型则用于对数据进行建模和预测，根据输入数据生成对应的输出结果。
### 编程准备
1.GitHub and markdown
2.**备份**
3.学习材料-***云文档***
4.系统准备-Docker
> [Markown官方教程](https://markdown.com.cn/basic-syntax/code.html)

## 学习计划
### 学习目标
### 学习方式
**总体方针：预习、直播+回放、作业实践**
## 一、基础阶段（1-2个月）
**目标**：掌握生物信息学的基本概念、理论和方法。学习Linux基础知识

**方法**：书本教材学习

**学习资源**：
- 《生物信息学》樊龙江*（已借阅）*
- 《鸟哥的Linux私房菜》
- Coursera上的“生物信息学：导论与方法”课程

## 二、核心阶段（2-4个月）
**目标**：理解并应用生物信息学的主要分析工具和技术。通过实际项目提升解决问题的能力。

**方法**：参与具体的生物信息学项目，亲身体验其解决生物问题的过程。编程与数据分析：学习Python/R等编程语言，掌握数据挖掘和统计分析技能。

**学习资源**：生物信息学实践基础教程

## 三、实践拓展技能（4-6个月）
**方法**：：了解生物信息学领域的最新进展和技术动态。

**内容**：学习AI、单细胞分析，了解不同领域应用案例。

**学习资源**：待补充
